##### Use to exclude duplicate answers 
1- SQL DISTINCT

##### For Even Number
2- WHERE ID%2=0

#### Difference between unique city and number of cities
3- SELECT COUNT(CITY) - COUNT(DISTINCT(CITY)) FROM STATION

#### Shortest city  name
4- SELECT CITY.LENGTH(CITY) AS LENGTH FROM STATION ORDER BY LENGTH, CITY LIMIT 1

##### Longest city name
5- SELECT CITY.LENGTH(CITY) AS LENGTH FROM STATION ORDER BY LENGTH DESC, CITY LIMIT 1

##### Select all city names starting with vowels 
6- SELECT DISTINCT(CITY) FROM STATION WHERE LEFT(CITY,1) IN ('a','e','o','I','u')

##### Select all city names ending with vowels

7- SELECT DISTINCT(CITY) FROM STATION WHERE RIGHT(CITY,1) IN ('a','e','o','I','u')

##### Select all city names DOESN'T start with vowels
8-  SELECT DISTINCT(CITY) FROM STATION WHERE LEFT(CITY,1) NOT IN ('a','e','o','I','u')

##### Query the Name of any student in STUDENTS who scored higher than  Marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID.

9- SELECT Name FROM STUDENTS WHERE Marks > 75 ORDER BY RIGHT(Name, 3), ID ASC;

#### Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order.

10 - SELECT NAME FROM EMPLOYEE ORDER BY NAME

#### Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than  per month who have been employees for less than  months. Sort your result by ascending employee_id.

11 - SELECT NAME FROM EMPLOYEE WHERE MONTHS < 10 AND SALARY > 2000 ORDER BY EMPLOYEE_ID ASC

#### Write a query identifying the type of each record in the TRIANGLES table using its three side lengths. Output one of the following statements for each record in the table:

#### Equilateral: It's a triangle with  sides of equal length.
#### Isosceles: It's a triangle with  sides of equal length.
#### Scalene: It's a triangle with  sides of differing lengths.
#### Not A Triangle: The given values of A, B, and C don't form a triangle.

In [ ]:
12 - SELECT 
        CASE 
            WHEN A + B <= C OR A + C <= B OR B + C <= A THEN 'Not A Triangle'
            WHEN A = B AND B = C THEN 'Equilateral'
            WHEN A = B OR A = C OR B = C THEN 'Isosceles'
            ELSE 'Scalene'
        END AS TriangleType
    FROM TRIANGLES;

#### Query an alphabetically ordered list of all names in OCCUPATIONS, immediately followed by the first letter of each profession as a parenthetical (i.e.: enclosed in parentheses). For example: AnActorName(A), ADoctorName(D), AProfessorName(P), and ASingerName(S).
#### Query the number of ocurrences of each occupation in OCCUPATIONS. Sort the occurrences in ascending order, and output them in the following format:

#### There are a total of [occupation_count] [occupation]s.
#### where [occupation_count] is the number of occurrences of an occupation in OCCUPATIONS and [occupation] is the lowercase occupation name. If more than one Occupation has the same [occupation_count], they should be ordered alphabetically.

In [ ]:
SELECT CONCAT(Name, '(', LEFT(Occupation, 1), ')') AS NameAndProfession
FROM OCCUPATIONS
UNION ALL
SELECT CONCAT('There are a total of ', occupation_count, ' ', LOWER(Occupation), 's.') AS Occupation_Count
FROM (
    SELECT COUNT(*) AS occupation_count, LOWER(Occupation) AS Occupation
    FROM OCCUPATIONS
    GROUP BY Occupation
) AS subquery 
ORDER BY NameAndProfession;

#### Pivot the Occupation column in OCCUPATIONS so that each Name is sorted alphabetically and displayed underneath its corresponding Occupation. The output column headers should be Doctor, Professor, Singer, and Actor, respectively.

Note: Print NULL when there are no more names corresponding to an occupation.

Input Format

The OCCUPATIONS table is described as follows:



Occupation will only contain one of the following values: Doctor, Professor, Singer or Actor.

Sample Input



Sample Output

Jenny    Ashley     Meera  Jane
Samantha Christeen  Priya  Julia
NULL     Ketty      NULL   Maria
Explanation

The first column is an alphabetically ordered list of Doctor names.
The second column is an alphabetically ordered list of Professor names.
The third column is an alphabetically ordered list of Singer names.
The fourth column is an alphabetically ordered list of Actor names.
The empty cell data for columns with less than the maximum number of names per occupation (in this case, the Professor and Actor columns) are filled with NULL values.

In [ ]:
SELECT 
    MAX(Doctor) AS Doctor,
    MAX(Professor) AS Professor,
    MAX(Singer) AS Singer,
    MAX(Actor) AS Actor
FROM 
    (SELECT 
        CASE WHEN Occupation = 'Doctor' THEN Name END AS Doctor,
        CASE WHEN Occupation = 'Professor' THEN Name END AS Professor,
        CASE WHEN Occupation = 'Singer' THEN Name END AS Singer,
        CASE WHEN Occupation = 'Actor' THEN Name END AS Actor,
        ROW_NUMBER() OVER (PARTITION BY Occupation ORDER BY Name) AS rn
    FROM 
        OCCUPATIONS
    ) AS OccupationsPivot
GROUP BY 
    rn
ORDER BY 
    rn;